Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.RoomVolumeNotComputedWarn Property
 [Family] volume can't be computed. The bounding geometry (in 3D) can't be found for [Room]. [Room] will be ignored in the energy analysis model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomVolumeNotComputedWarn { get; }
Public Shared ReadOnly Property RoomVolumeNotComputedWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomVolumeNotComputedWarn {
	FailureDefinitionId^ get ();
}
static member RoomVolumeNotComputedWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace